{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "reminder",
    "1": "unit_conversion",
    "2": "joke",
    "3": "open_application",
    "4": "unknown",
    "5": "fact",
    "6": "news_update",
    "7": "translation",
    "8": "weather_query",
    "9": "send_message",
    "10": "calculator",
    "11": "set_alarm",
    "12": "play_music",
    "13": "web_search",
    "14": "calendar_event"
  },
  "initializer_range": 0.02,
  "label2id": {
    "calculator": 10,
    "calendar_event": 14,
    "fact": 5,
    "joke": 2,
    "news_update": 6,
    "open_application": 3,
    "play_music": 12,
    "reminder": 0,
    "send_message": 9,
    "set_alarm": 11,
    "translation": 7,
    "unit_conversion": 1,
    "unknown": 4,
    "weather_query": 8,
    "web_search": 13
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "vocab_size": 30522
}
